Revit 2024 API
Transaction.GetFailureHandlingOptions Method
 Returns the current failure handling options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FailureHandlingOptions GetFailureHandlingOptions()
Visual Basic
Public Function GetFailureHandlingOptions As FailureHandlingOptions
Visual C++
public:
FailureHandlingOptions^ GetFailureHandlingOptions()
Return Value
 An instance of FailureHandlingOptions
Remarks
 The returned instance is a copy of the options. If changes are made to the options, the new version can be set back to the transaction by calling the SetFailureHandlingOptions(FailureHandlingOptions) method.
See Also
Transaction Class
Autodesk.Revit.DB Namespace